In [2]:
import pandas as pd
dic1 = {'name': ['a', 'a', 'a', 'a', 'b', 'b', 'b'],'id': ['B', 'B', 'B', 'C', 'C', 'D', 'E'],
        'score_2': [1, -1, 2, 4, 21, 23, 7], 'score_3': [1, 1, 2, 22, 22, 23, 7]}

frame1 = pd.DataFrame(dic1)

In [3]:
frame1

  name id  score_2  score_3
0    a  B        1        1
1    a  B       -1        1
2    a  B        2        2
3    a  C        4       22
4    b  C       21       22
5    b  D       23       23
6    b  E        7        7

In [4]:
frame1['score_4']=frame1['score_3']+10

In [4]:
frame1

  name id  score_2  score_3  score_4
0    a  B        1        1       11
1    a  B       -1        1       11
2    a  B        2        2       12
3    a  C        4       22       32
4    b  C       21       22       32
5    b  D       23       23       33
6    b  E        7        7       17